In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("Sales.csv")

In [4]:
import numpy as np
df_1 = pd.DataFrame(data=np.random.randn(5,4), index="A B C D E".split(), columns="W X Y Z".split())

In [5]:
df.to_csv("nombre")

In [6]:
df

  Company   Person  Sales  Compensation
0    GOOG      Sam     30        3000.0
1    GOOG  Charlie     34        3500.0
2    MSFT      Amy     54           NaN
3    MSFT  Vanessa     23        2800.0
4      FB     Carl     45        5000.0
5      FB    Sarah     12        1200.0

In [7]:
df.head()

  Company   Person  Sales  Compensation
0    GOOG      Sam     30        3000.0
1    GOOG  Charlie     34        3500.0
2    MSFT      Amy     54           NaN
3    MSFT  Vanessa     23        2800.0
4      FB     Carl     45        5000.0

In [8]:
df.tail(2)

  Company Person  Sales  Compensation
4      FB   Carl     45        5000.0
5      FB  Sarah     12        1200.0

In [9]:
df.describe()

           Sales  Compensation
count   6.000000      5.000000
mean   33.000000   3100.000000
std    15.073155   1367.479433
min    12.000000   1200.000000
25%    24.750000   2800.000000
50%    32.000000   3000.000000
75%    42.250000   3500.000000
max    54.000000   5000.000000

In [10]:
df["Sales"]

0    30
1    34
2    54
3    23
4    45
5    12
Name: Sales, dtype: int64

In [11]:
df[["Sales", "Compensation"]]

   Sales  Compensation
0     30        3000.0
1     34        3500.0
2     54           NaN
3     23        2800.0
4     45        5000.0
5     12        1200.0

In [12]:
df_1

          W         X         Y         Z
A -1.381005 -2.500024  0.532735  0.327251
B  0.673457 -1.321165 -0.040549  0.748568
C -1.346216  0.250579 -1.315806  1.172854
D -0.440638  2.111248 -0.054029  0.213823
E -0.123530 -0.980313  1.324690 -1.350138

In [14]:
df_1.loc["A"]

W   -1.381005
X   -2.500024
Y    0.532735
Z    0.327251
Name: A, dtype: float64

In [15]:
df_1.loc["A", "W"]

-1.3810045646013482

In [16]:
df.iloc[2]

Company         MSFT
Person           Amy
Sales             54
Compensation     NaN
Name: 2, dtype: object

In [17]:
df.iloc[2, 2]

54

In [18]:
df > 20

   Company  Person  Sales  Compensation
0     True    True   True          True
1     True    True   True          True
2     True    True   True         False
3     True    True   True          True
4     True    True   True          True
5     True    True  False          True

In [19]:
df[df["Sales"] > 20]

  Company   Person  Sales  Compensation
0    GOOG      Sam     30        3000.0
1    GOOG  Charlie     34        3500.0
2    MSFT      Amy     54           NaN
3    MSFT  Vanessa     23        2800.0
4      FB     Carl     45        5000.0

In [21]:
df[(df["Compensation"] > 1000) & (df["Compensation"] < 2000)]

  Company Person  Sales  Compensation
5      FB  Sarah     12        1200.0

In [22]:
df.mean()

Sales             33.0
Compensation    3100.0
dtype: float64

In [23]:
df.std()

Sales             15.073155
Compensation    1367.479433
dtype: float64

In [24]:
df["Sales"].mean()

33.0

In [25]:
df["Compensation"].apply(lambda x: x*12)

0    36000.0
1    42000.0
2        NaN
3    33600.0
4    60000.0
5    14400.0
Name: Compensation, dtype: float64

In [26]:
df["Person"].apply(len)

0    3
1    7
2    3
3    7
4    4
5    5
Name: Person, dtype: int64

In [28]:
df["Sales"].unique()

array([30, 34, 54, 23, 45, 12])

In [29]:
df["Sales"].max().head(2)

AttributeError: 'numpy.int64' object has no attribute 'head'